#### [`repos-official-new`] Terraform Plan 📖`success`

<a href="https://app.terraform.io/app/cdktf-team/prebuilt-providers-official-new/runs/run-1A4WnKXKxnpC1wkD" target="_blank">Remote Plan Link ↗️</a>

<details><summary>Show Plan</summary>

```tf
[command]/home/runner/work/_temp/22df0460-1f47-4df7-8cf9-0050b38641e5/terraform-bin plan -no-color
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cdktf-team/prebuilt-providers-official-new/runs/run-1A4WnKXKxnpC1wkD

Waiting for the plan to start...

Terraform v1.3.1
on linux_amd64
Initializing plugins and modules...
data.github_team.reposofficialnew_cdktfteamcdktf_4A2C9F8E: Reading...
data.github_team.reposofficialnew_cdktfteamcdktf_4A2C9F8E: Read complete after 8s [id=6602018]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_branch_protection.reposofficialnew_cdktfproviderad_repositorysetup_mainprotection_67975441 will be updated in-place
  ~ resource "github_branch_protection" "reposofficialnew_cdktfproviderad_repositorysetup_mainprotection_67975441" {
        id                              = "BPR_kwDOIIyyB84B07ra"
      ~ require_conversation_resolution = false -> true
        # (9 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.reposofficialnew_cdktfproviderazurestack_repositorysetup_mainprotection_A3308AE9 will be updated in-place
  ~ resource "github_branch_protection" "reposofficialnew_cdktfproviderazurestack_repositorysetup_mainprotection_A3308AE9" {
        id                              = "BPR_kwDOIIy1rc4B07rr"
      ~ require_conversation_resolution = false -> true
        # (9 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.reposofficialnew_cdktfproviderboundary_repositorysetup_mainprotection_C6785CF1 will be updated in-place
  ~ resource "github_branch_protection" "reposofficialnew_cdktfproviderboundary_repositorysetup_mainprotection_C6785CF1" {
        id                              = "BPR_kwDOIIy5Y84B07sy"
      ~ require_conversation_resolution = false -> true
        # (9 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.reposofficialnew_cdktfproviderconsul_repositorysetup_mainprotection_0FD965B5 will be updated in-place
  ~ resource "github_branch_protection" "reposofficialnew_cdktfproviderconsul_repositorysetup_mainprotection_0FD965B5" {
        id                              = "BPR_kwDOIIy2Yc4B07sL"
      ~ require_conversation_resolution = false -> true
        # (9 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.reposofficialnew_cdktfproviderdns_repositorysetup_mainprotection_29DCB0B4 will be updated in-place
  ~ resource "github_branch_protection" "reposofficialnew_cdktfproviderdns_repositorysetup_mainprotection_29DCB0B4" {
        id                              = "BPR_kwDOIIyxt84B07q3"
      ~ require_conversation_resolution = false -> true
        # (9 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.reposofficialnew_cdktfprovidergoogleworkspace_repositorysetup_mainprotection_5296EBDE will be updated in-place
  ~ resource "github_branch_protection" "reposofficialnew_cdktfprovidergoogleworkspace_repositorysetup_mainprotection_5296EBDE" {
        id                              = "BPR_kwDOIIyyfc4B07rF"
      ~ require_conversation_resolution = false -> true
        # (9 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.reposofficialnew_cdktfproviderhcp_repositorysetup_mainprotection_2F3985BD will be updated in-place
  ~ resource "github_branch_protection" "reposofficialnew_cdktfproviderhcp_repositorysetup_mainprotection_2F3985BD" {
        id                              = "BPR_kwDOIIy2jc4B07ru"
      ~ require_conversation_resolution = false -> true
        # (9 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.reposofficialnew_cdktfproviderhcs_repositorysetup_mainprotection_41480D25 will be updated in-place
  ~ resource "github_branch_protection" "reposofficialnew_cdktfproviderhcs_repositorysetup_mainprotection_41480D25" {
        id                              = "BPR_kwDOIIy5dc4B07sh"
      ~ require_conversation_resolution = false -> true
        # (9 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.reposofficialnew_cdktfproviderhttp_repositorysetup_mainprotection_B33863E9 will be updated in-place
  ~ resource "github_branch_protection" "reposofficialnew_cdktfproviderhttp_repositorysetup_mainprotection_B33863E9" {
        id                              = "BPR_kwDOIIyyU84B07q8"
      ~ require_conversation_resolution = false -> true
        # (9 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.reposofficialnew_cdktfprovidernomad_repositorysetup_mainprotection_13C0DCFB will be updated in-place
  ~ resource "github_branch_protection" "reposofficialnew_cdktfprovidernomad_repositorysetup_mainprotection_13C0DCFB" {
        id                              = "BPR_kwDOIIy2os4B07sB"
      ~ require_conversation_resolution = false -> true
        # (9 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.reposofficialnew_cdktfprovideropc_repositorysetup_mainprotection_010523D3 will be updated in-place
  ~ resource "github_branch_protection" "reposofficialnew_cdktfprovideropc_repositorysetup_mainprotection_010523D3" {
        id                              = "BPR_kwDOIIy5Us4B07r0"
      ~ require_conversation_resolution = false -> true
        # (9 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.reposofficialnew_cdktfprovideroraclepaas_repositorysetup_mainprotection_8A38A381 will be updated in-place
  ~ resource "github_branch_protection" "reposofficialnew_cdktfprovideroraclepaas_repositorysetup_mainprotection_8A38A381" {
        id                              = "BPR_kwDOIIy5EM4B07so"
      ~ require_conversation_resolution = false -> true
        # (9 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.reposofficialnew_cdktfprovidersalesforce_repositorysetup_mainprotection_DE212A5B will be updated in-place
  ~ resource "github_branch_protection" "reposofficialnew_cdktfprovidersalesforce_repositorysetup_mainprotection_DE212A5B" {
        id                              = "BPR_kwDOIIy2Mc4B07sN"
      ~ require_conversation_resolution = false -> true
        # (9 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.reposofficialnew_cdktfprovidervsphere_repositorysetup_mainprotection_28589C45 will be updated in-place
  ~ resource "github_branch_protection" "reposofficialnew_cdktfprovidervsphere_repositorysetup_mainprotection_28589C45" {
        id                              = "BPR_kwDOIIyyHM4B07rh"
      ~ require_conversation_resolution = false -> true
        # (9 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.reposofficialnew_cdktfproviderwaypoint_repositorysetup_mainprotection_9AF3484C will be updated in-place
  ~ resource "github_branch_protection" "reposofficialnew_cdktfproviderwaypoint_repositorysetup_mainprotection_9AF3484C" {
        id                              = "BPR_kwDOJ6pr-M4CWWQh"
      ~ require_conversation_resolution = false -> true
        # (9 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_issue_label.reposofficialnew_cdktfproviderad_repositorysetup_autoapprovelabel_33590023 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderad_repositorysetup_autoapprovelabel_33590023" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-ad"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfprovideradgo_repositorysetup_autoapprovelabel_36209FF5 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfprovideradgo_repositorysetup_autoapprovelabel_36209FF5" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-ad-go"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderazurestack_repositorysetup_autoapprovelabel_E511A895 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderazurestack_repositorysetup_autoapprovelabel_E511A895" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-azurestack"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderazurestackgo_repositorysetup_autoapprovelabel_772EE073 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderazurestackgo_repositorysetup_autoapprovelabel_772EE073" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-azurestack-go"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderboundary_repositorysetup_autoapprovelabel_787B441D will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderboundary_repositorysetup_autoapprovelabel_787B441D" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-boundary"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderboundarygo_repositorysetup_autoapprovelabel_2FC8A534 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderboundarygo_repositorysetup_autoapprovelabel_2FC8A534" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-boundary-go"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderconsul_repositorysetup_autoapprovelabel_3F56CD58 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderconsul_repositorysetup_autoapprovelabel_3F56CD58" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-consul"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderconsulgo_repositorysetup_autoapprovelabel_D2C02191 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderconsulgo_repositorysetup_autoapprovelabel_D2C02191" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-consul-go"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderdns_repositorysetup_autoapprovelabel_207CF28B will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderdns_repositorysetup_autoapprovelabel_207CF28B" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-dns"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderdnsgo_repositorysetup_autoapprovelabel_57880729 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderdnsgo_repositorysetup_autoapprovelabel_57880729" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-dns-go"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfprovidergoogleworkspace_repositorysetup_autoapprovelabel_4DCEBD08 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfprovidergoogleworkspace_repositorysetup_autoapprovelabel_4DCEBD08" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-googleworkspace"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfprovidergoogleworkspacego_repositorysetup_autoapprovelabel_0C7E0F1F will be created
  + resource "github_issue_label" "reposofficialnew_cdktfprovidergoogleworkspacego_repositorysetup_autoapprovelabel_0C7E0F1F" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-googleworkspace-go"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderhcp_repositorysetup_autoapprovelabel_1582A5ED will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderhcp_repositorysetup_autoapprovelabel_1582A5ED" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-hcp"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderhcpgo_repositorysetup_autoapprovelabel_15EB9C0F will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderhcpgo_repositorysetup_autoapprovelabel_15EB9C0F" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-hcp-go"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderhcs_repositorysetup_autoapprovelabel_C564D3CB will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderhcs_repositorysetup_autoapprovelabel_C564D3CB" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-hcs"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderhcsgo_repositorysetup_autoapprovelabel_DADBEBBB will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderhcsgo_repositorysetup_autoapprovelabel_DADBEBBB" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-hcs-go"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderhttp_repositorysetup_autoapprovelabel_C20575FB will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderhttp_repositorysetup_autoapprovelabel_C20575FB" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-http"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderhttpgo_repositorysetup_autoapprovelabel_C9911B69 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderhttpgo_repositorysetup_autoapprovelabel_C9911B69" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-http-go"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfprovidernomad_repositorysetup_autoapprovelabel_3410E311 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfprovidernomad_repositorysetup_autoapprovelabel_3410E311" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-nomad"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfprovidernomadgo_repositorysetup_autoapprovelabel_38213498 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfprovidernomadgo_repositorysetup_autoapprovelabel_38213498" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-nomad-go"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfprovideropc_repositorysetup_autoapprovelabel_F2BAD446 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfprovideropc_repositorysetup_autoapprovelabel_F2BAD446" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-opc"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfprovideropcgo_repositorysetup_autoapprovelabel_963B0AFD will be created
  + resource "github_issue_label" "reposofficialnew_cdktfprovideropcgo_repositorysetup_autoapprovelabel_963B0AFD" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-opc-go"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfprovideroraclepaas_repositorysetup_autoapprovelabel_7968596A will be created
  + resource "github_issue_label" "reposofficialnew_cdktfprovideroraclepaas_repositorysetup_autoapprovelabel_7968596A" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-oraclepaas"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfprovideroraclepaasgo_repositorysetup_autoapprovelabel_CF375098 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfprovideroraclepaasgo_repositorysetup_autoapprovelabel_CF375098" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-oraclepaas-go"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfprovidersalesforce_repositorysetup_autoapprovelabel_BDA4DA83 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfprovidersalesforce_repositorysetup_autoapprovelabel_BDA4DA83" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-salesforce"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfprovidersalesforcego_repositorysetup_autoapprovelabel_6E216B7D will be created
  + resource "github_issue_label" "reposofficialnew_cdktfprovidersalesforcego_repositorysetup_autoapprovelabel_6E216B7D" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-salesforce-go"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfprovidervsphere_repositorysetup_autoapprovelabel_E6CE0210 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfprovidervsphere_repositorysetup_autoapprovelabel_E6CE0210" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-vsphere"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfprovidervspherego_repositorysetup_autoapprovelabel_D5BAE028 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfprovidervspherego_repositorysetup_autoapprovelabel_D5BAE028" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-vsphere-go"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderwaypoint_repositorysetup_autoapprovelabel_F2DE455E will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderwaypoint_repositorysetup_autoapprovelabel_F2DE455E" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-waypoint"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderwaypointgo_repositorysetup_autoapprovelabel_FCAAA8DB will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderwaypointgo_repositorysetup_autoapprovelabel_FCAAA8DB" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-waypoint-go"
      + url        = (known after apply)
    }

  # github_repository.reposofficialnew_cdktfproviderad_repo_B501EA48 will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfproviderad_repo_B501EA48" {
      ~ allow_auto_merge            = false -> true
        id                          = "cdktf-provider-ad"
        name                        = "cdktf-provider-ad"
        # (32 unchanged attributes hidden)
    }

  # github_repository.reposofficialnew_cdktfprovideradgo_repo_E962AB9E will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfprovideradgo_repo_E962AB9E" {
      ~ allow_auto_merge            = false -> true
        id                          = "cdktf-provider-ad-go"
        name                        = "cdktf-provider-ad-go"
        # (32 unchanged attributes hidden)
    }

  # github_repository.reposofficialnew_cdktfproviderazurestack_repo_F02F6EBF will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfproviderazurestack_repo_F02F6EBF" {
      ~ allow_auto_merge            = false -> true
        id                          = "cdktf-provider-azurestack"
        name                        = "cdktf-provider-azurestack"
        # (32 unchanged attributes hidden)
    }

  # github_repository.reposofficialnew_cdktfproviderazurestackgo_repo_A52C1E1A will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfproviderazurestackgo_repo_A52C1E1A" {
      ~ allow_auto_merge            = false -> true
        id                          = "cdktf-provider-azurestack-go"
        name                        = "cdktf-provider-azurestack-go"
        # (32 unchanged attributes hidden)
    }

  # github_repository.reposofficialnew_cdktfproviderboundary_repo_1EF8E2A8 will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfproviderboundary_repo_1EF8E2A8" {
      ~ allow_auto_merge            = false -> true
        id                          = "cdktf-provider-boundary"
        name                        = "cdktf-provider-boundary"
        # (32 unchanged attributes hidden)
    }

  # github_repository.reposofficialnew_cdktfproviderboundarygo_repo_8F564388 will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfproviderboundarygo_repo_8F564388" {
      ~ allow_auto_merge            = false -> true
        id                          = "cdktf-provider-boundary-go"
        name                        = "cdktf-provider-boundary-go"
        # (32 unchanged attributes hidden)
    }

  # github_repository.reposofficialnew_cdktfproviderconsul_repo_EA05D767 will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfproviderconsul_repo_EA05D767" {
      ~ allow_auto_merge            = false -> true
        id                          = "cdktf-provider-consul"
        name                        = "cdktf-provider-consul"
        # (32 unchanged attributes hidden)
    }

  # github_repository.reposofficialnew_cdktfproviderconsulgo_repo_6C3E1652 will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfproviderconsulgo_repo_6C3E1652" {
      ~ allow_auto_merge            = false -> true
        id                          = "cdktf-provider-consul-go"
        name                        = "cdktf-provider-consul-go"
        # (32 unchanged attributes hidden)
    }

  # github_repository.reposofficialnew_cdktfproviderdns_repo_E696C338 will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfproviderdns_repo_E696C338" {
      ~ allow_auto_merge            = false -> true
        id                          = "cdktf-provider-dns"
        name                        = "cdktf-provider-dns"
        # (32 unchanged attributes hidden)
    }

  # github_repository.reposofficialnew_cdktfproviderdnsgo_repo_D8B14775 will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfproviderdnsgo_repo_D8B14775" {
      ~ allow_auto_merge            = false -> true
        id                          = "cdktf-provider-dns-go"
        name                        = "cdktf-provider-dns-go"
        # (32 unchanged attributes hidden)
    }

  # github_repository.reposofficialnew_cdktfprovidergoogleworkspace_repo_DC6187AE will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfprovidergoogleworkspace_repo_DC6187AE" {
      ~ allow_auto_merge            = false -> true
        id                          = "cdktf-provider-googleworkspace"
        name                        = "cdktf-provider-googleworkspace"
        # (32 unchanged attributes hidden)
    }

  # github_repository.reposofficialnew_cdktfprovidergoogleworkspacego_repo_A0A12185 will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfprovidergoogleworkspacego_repo_A0A12185" {
      ~ allow_auto_merge            = false -> true
        id                          = "cdktf-provider-googleworkspace-go"
        name                        = "cdktf-provider-googleworkspace-go"
        # (32 unchanged attributes hidden)
    }

  # github_repository.reposofficialnew_cdktfproviderhcp_repo_BAD7E858 will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfproviderhcp_repo_BAD7E858" {
      ~ allow_auto_merge            = false -> true
        id                          = "cdktf-provider-hcp"
        name                        = "cdktf-provider-hcp"
        # (32 unchanged attributes hidden)
    }

  # github_repository.reposofficialnew_cdktfproviderhcpgo_repo_B866A962 will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfproviderhcpgo_repo_B866A962" {
      ~ allow_auto_merge            = false -> true
        id                          = "cdktf-provider-hcp-go"
        name                        = "cdktf-provider-hcp-go"
        # (32 unchanged attributes hidden)
    }

  # github_repository.reposofficialnew_cdktfproviderhcs_repo_1C1956F4 will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfproviderhcs_repo_1C1956F4" {
      ~ allow_auto_merge            = false -> true
        id                          = "cdktf-provider-hcs"
        name                        = "cdktf-provider-hcs"
        # (32 unchanged attributes hidden)
    }

  # github_repository.reposofficialnew_cdktfproviderhcsgo_repo_DDBF52DC will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfproviderhcsgo_repo_DDBF52DC" {
      ~ allow_auto_merge            = false -> true
        id                          = "cdktf-provider-hcs-go"
        name                        = "cdktf-provider-hcs-go"
        # (32 unchanged attributes hidden)
    }

  # github_repository.reposofficialnew_cdktfproviderhttp_repo_0228697D will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfproviderhttp_repo_0228697D" {
      ~ allow_auto_merge            = false -> true
        id                          = "cdktf-provider-http"
        name                        = "cdktf-provider-http"
        # (32 unchanged attributes hidden)
    }

  # github_repository.reposofficialnew_cdktfproviderhttpgo_repo_3253ED7E will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfproviderhttpgo_repo_3253ED7E" {
      ~ allow_auto_merge            = false -> true
        id                          = "cdktf-provider-http-go"
        name                        = "cdktf-provider-http-go"
        # (32 unchanged attributes hidden)
    }

  # github_repository.reposofficialnew_cdktfprovidernomad_repo_E3E08A10 will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfprovidernomad_repo_E3E08A10" {
      ~ allow_auto_merge            = false -> true
        id                          = "cdktf-provider-nomad"
        name                        = "cdktf-provider-nomad"
        # (32 unchanged attributes hidden)
    }

  # github_repository.reposofficialnew_cdktfprovidernomadgo_repo_E20DF0A6 will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfprovidernomadgo_repo_E20DF0A6" {
      ~ allow_auto_merge            = false -> true
        id                          = "cdktf-provider-nomad-go"
        name                        = "cdktf-provider-nomad-go"
        # (32 unchanged attributes hidden)
    }

  # github_repository.reposofficialnew_cdktfprovideropc_repo_36585570 will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfprovideropc_repo_36585570" {
      ~ allow_auto_merge            = false -> true
        id                          = "cdktf-provider-opc"
        name                        = "cdktf-provider-opc"
        # (32 unchanged attributes hidden)
    }

  # github_repository.reposofficialnew_cdktfprovideropcgo_repo_3FB9B00C will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfprovideropcgo_repo_3FB9B00C" {
      ~ allow_auto_merge            = false -> true
        id                          = "cdktf-provider-opc-go"
        name                        = "cdktf-provider-opc-go"
        # (32 unchanged attributes hidden)
    }

  # github_repository.reposofficialnew_cdktfprovideroraclepaas_repo_59E01823 will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfprovideroraclepaas_repo_59E01823" {
      ~ allow_auto_merge            = false -> true
        id                          = "cdktf-provider-oraclepaas"
        name                        = "cdktf-provider-oraclepaas"
        # (32 unchanged attributes hidden)
    }

  # github_repository.reposofficialnew_cdktfprovideroraclepaasgo_repo_7B5D271C will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfprovideroraclepaasgo_repo_7B5D271C" {
      ~ allow_auto_merge            = false -> true
        id                          = "cdktf-provider-oraclepaas-go"
        name                        = "cdktf-provider-oraclepaas-go"
        # (32 unchanged attributes hidden)
    }

  # github_repository.reposofficialnew_cdktfprovidersalesforce_repo_00119DDA will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfprovidersalesforce_repo_00119DDA" {
      ~ allow_auto_merge            = false -> true
        id                          = "cdktf-provider-salesforce"
        name                        = "cdktf-provider-salesforce"
        # (32 unchanged attributes hidden)
    }

  # github_repository.reposofficialnew_cdktfprovidersalesforcego_repo_2BE83507 will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfprovidersalesforcego_repo_2BE83507" {
      ~ allow_auto_merge            = false -> true
        id                          = "cdktf-provider-salesforce-go"
        name                        = "cdktf-provider-salesforce-go"
        # (32 unchanged attributes hidden)
    }

  # github_repository.reposofficialnew_cdktfprovidervsphere_repo_AD726BE1 will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfprovidervsphere_repo_AD726BE1" {
      ~ allow_auto_merge            = false -> true
        id                          = "cdktf-provider-vsphere"
        name                        = "cdktf-provider-vsphere"
        # (32 unchanged attributes hidden)
    }

  # github_repository.reposofficialnew_cdktfprovidervspherego_repo_2CCCF4D0 will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfprovidervspherego_repo_2CCCF4D0" {
      ~ allow_auto_merge            = false -> true
        id                          = "cdktf-provider-vsphere-go"
        name                        = "cdktf-provider-vsphere-go"
        # (32 unchanged attributes hidden)
    }

  # github_repository.reposofficialnew_cdktfproviderwaypoint_repo_88065F9C will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfproviderwaypoint_repo_88065F9C" {
      ~ allow_auto_merge            = false -> true
        id                          = "cdktf-provider-waypoint"
        name                        = "cdktf-provider-waypoint"
        # (32 unchanged attributes hidden)
    }

  # github_repository.reposofficialnew_cdktfproviderwaypointgo_repo_A9252B7B will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfproviderwaypointgo_repo_A9252B7B" {
      ~ allow_auto_merge            = false -> true
        id                          = "cdktf-provider-waypoint-go"
        name                        = "cdktf-provider-waypoint-go"
        # (32 unchanged attributes hidden)
    }

Plan: 30 to add, 45 to change, 0 to destroy.

::debug::Terraform exited with code 0.
::debug::stderr: 
::debug::exitcode: 0

```

</details>

*Pusher: @xiehan, Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*